## Pandas

#### Pandas usecases:
    1.Data Transformation
    2.Data Analysis
    3.Data Cleaning
#### Pandas Notations:
    *Series ------- Creating the data
    *DataFrame ---- For Making the data in a particular tabular form

In [4]:
import pandas as pd
internal1={'s1':25,'s2':21,'s3':15}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':22,'s2':26,'s3':30}
internal2=pd.Series(internal2)
print(internal2)

s1    25
s2    21
s3    15
dtype: int64
s1    22
s2    26
s3    30
dtype: int64

In [5]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
print(final)

    Internal1  Internal2
s1         25         22
s2         21         26
s3         15         30

In [13]:
import pandas as pd
rollno={'usha':547,'siri':507,'vyshu':515}
rollno=pd.Series(rollno)
print(rollno)
internal1={'usha':25,'siri':21,'vyshu':15}
internal1=pd.Series(internal1)
print(internal1)
internal2={'usha':22,'siri':26,'vyshu':30}
internal2=pd.Series(internal2)
print(internal2)

usha     547
siri     507
vyshu    515
dtype: int64
usha     25
siri     21
vyshu    15
dtype: int64
usha     22
siri     26
vyshu    30
dtype: int64

In [14]:
final={'RollNo':rollno,'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
print(final)

       RollNo  Internal1  Internal2
usha      547         25         22
siri      507         21         26
vyshu     515         15         30

In [15]:
final

       RollNo  Internal1  Internal2
usha      547         25         22
siri      507         21         26
vyshu     515         15         30

In [16]:
final.columns

Index(['RollNo', 'Internal1', 'Internal2'], dtype='object')

In [17]:
final.values

array([[547,  25,  22],
       [507,  21,  26],
       [515,  15,  30]], dtype=int64)

In [29]:
final.values[1,0]

507

In [19]:
final.values[1]

array([507,  21,  26], dtype=int64)

In [20]:
for i in final.values:
    print(i[0])

547
507
515

In [21]:
for i in final.values:
    print(i[0],i[1],i[2])

547 25 22
507 21 26
515 15 30

In [22]:
final.loc['sri']=[546,27,25]

In [23]:
final

       RollNo  Internal1  Internal2
usha      547         25         22
siri      507         21         26
vyshu     515         15         30
sri       546         27         25

In [24]:
final.drop('sri')

       RollNo  Internal1  Internal2
usha      547         25         22
siri      507         21         26
vyshu     515         15         30

In [25]:
final.values[3]=[531,27,25]

In [26]:
final

       RollNo  Internal1  Internal2
usha      547         25         22
siri      507         21         26
vyshu     515         15         30
sri       531         27         25

In [31]:
### Reading the csv file using Pandas:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,Californi,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [32]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'Californi', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [33]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [34]:
income.values[1][1]

'Alaska'

In [36]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
Californi : 57528

In [38]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933